/* จำนวนที่หารด้วย 3 หรือ 5 ลงตัวที่อยู่ระหว่าง 1 และ 10000 มีกี่จำนวน */
public class a34 {
    public static void main(String[] args) {
        int count = 0;

        for (int i = 1; i <= 10000; i++) {
            // ตรวจสอบว่า i หารด้วย 3 หรือ 5 ลงตัว
            if (i % 3 == 0 || i % 5 == 0) {
                count++; // เพิ่มจำนวนที่ตรงเงื่อนไขลงในตัวแปร count
            }
        }

        System.out.println("จำนวนที่หารด้วย 3 หรือ 5 ลงตัวที่อยู่ระหว่าง 1 และ 10000: " + count + "จำนวน" );
    }
}
